#include <iostream>
#include <cmath>
#include <time.h>
#include <string>
#include <sstream>
#include "Library.h"
using namespace std;

void main()
{
	setlocale(LC_ALL, "rus");

	/*
		РЎРѕР·РґР°С‘Рј Р°РІС‚РѕСЂР°
		Р”РѕР±Р°РІР»СЏРµРј РµРіРѕ РєРЅРёРіРё
		Р”РѕР±Р°РІР»СЏРµРј СЌС‚Рё РєРЅРёРіРё РІ СЂР°Р·РґРµР»С‹
		Р”РѕР±Р°РІР»СЏРµРј РїРѕР»СЊР·РѕРІР°С‚РµР»РµР№
		РћРЅРё Р±РµСЂСѓС‚ РєРЅРёРіРё
		РљР°РєРёРµ-С‚Рѕ РІРѕР·РІСЂР°С‰Р°СЋС‚
		РЈРґР°Р»СЏРµРј РєРЅРёРіСѓ
		РЈРґР°СЏР»РµРј РїРѕР»СЊР·РѕРІР°С‚РµР»СЏ
	*/
}